<?php

return [
    'dashboard' => 'الرئيسيه',
    'login' => 'تسجيل الدخول',
    'register' => 'إنشاء حساب جديد',
    'logout' => 'تسجيل الخروج',
    'remember_me' => 'تذكرني',
    'password' => 'كلمه المرور',
    'password_confirmation' => 'تأكيد كلمه المرور',
    'email' => 'البريد الإلكتروني',
    'forgot_password' => 'فقدت كلمة المرور',
    'recover_account' => 'استرجاع الحساب',
    'text_inst_recover' => 'أدخل بريدك الإلكتروني و سنقوم بارسال التعليمات لك',
    'text_inst_register' => 'أدخل كافة البيانات لإنشاء حسابك',
    'send' => 'ارسال',
    'the_link_reset_sent' => 'تم ارسال رسالة الى بريدك الإلكتروني، يرجى اتباع التعليمات لاستعادة كلمة المرور الخاصة بك.',
    'recover_password' => 'إعادة تعيين كلمة المرور',
    'text_type_password' => 'أدخل كلمة المرور الخاصة بك',
    'text_register' => 'ليس لديك حساب ؟ ',
    'text_register_successfully' => 'تم إنشاء الحساب بنجاح ',
    'text_login' => 'لديك حساب ',
    'new_account' => 'حساب جديد ',
    'text_type_password_confirmation' => 'أدخل تأكيد كلمة المرور الجديدة',
    'text_change' => 'تغيير',
    'password_changed_successfully' => 'تمت عملية إعادة تعيين كلمة المرور بنجاح،',
    'token_is_expired' => 'الرمز المميز انتهت صلاحيته يرجى اعادة المحاولة',
    'change_password_failed' => 'للأسف فشلت عملية استعادة كلمة المرور',
    'email_incorrect' => 'البريد الإلكتروني الذي أدخلته غير صحيح',
    'profile' => 'الحساب الشخصي ',
    'save' => 'حفظ ',
    'cancel' => 'الغاء ',
    'name' => 'الاسم ',
    'avatar' => 'الصورة الشخصية ',
    'admin_email' => 'بريد المشرف ',
    'admin_name' => 'اسم المشرف ',
    'added_successfully' => 'تم اضافه البيانات بنجاح',
    'updated_successfully' => 'تم تعديل البيانات بنجاح',
    'deleted_successfully' => 'تم حذف البيانات بنجاح',
    'arabic' => 'عربى ',
    'english' => 'انجليزى ',
    'main_lang' => 'اللغة الافتراضية ',
    'settings' => 'الاعدادات ',
    'logo' => 'شعار الموقع ',
    'icon' => 'رمز الموقع ',
    'keywords' => 'الكلمات الدليلية ',
    'status' => 'الحالة ',
    'open' => 'مفتوح ',
    'message_maintenance' => 'رسالة الصيانة ',
    'close' => 'مغلق ',
    'phone' => 'رقم الهاتف ',
    'address' => 'العنوان الشخصي ',
    'facebook' => 'صفحة الفيسبوك ',
    'twitter' => 'صفحة تويتر ',
    'google' => 'صفحة الجوجل + ',
    'no_data_found' => 'للاسف لا يوجد اي سجلات ',
    'action' => 'أكشن ',
    'add' => 'اضف ',
    'create' => 'إضافه ',
    'read' => 'عرض ',
    'edit' => 'تعديل ',
    'update' => 'تعديل ',
    'delete' => 'حذف ',
    'search' => 'بحث ',
    'reset_password' => 'إعادة تعيين كلمة المرور',
    'send_password_reset_link' => 'إرسال رابط لإعادة تعيين كلمة المرور',
    'text_confirm_password' => 'الرجاء التأكد من كلمة المرور قبل المتابعة',
    'our_first_laravel_blog' => 'مدونتنا الأولى للارافيل',
    'latest_blog' => 'أحدث مدونة',
    'popular_blogs' => 'أشهر المدونات',
    'categories' => 'التصنيفات',
    'search' => 'أبحث',
    'home' => 'الرئيسية',
    'blogs' => 'المقالات',
    'about' => 'عنا',
    'contact' => 'تواصل معنا',
    'my_blogs' => 'مقالاتي',
    'profile' => 'حسابي',
    'message' => 'الرسالة',
    'submit' => 'أرسل',
    'we_are_happy_to_hear_from_you' => 'نحن سعداء أن نسمع منك',
    'about_us' => 'معلومات عنا',
    'about_text' => 'إنها حقيقة مثبتة منذ زمن طويل أن المحتوى المقروء للصفحة سوف يشتت انتباه القارئ عند النظر إلى تخطيطها. الهدف من استخدام لوريم إيبسوم. في المقام الأول، لقد منحنا الله، وبهذا أكد ميثاقنا الحالي لنا ولورثتنا إلى الأبد أن الكنيسة الإنجليزية ستكون حرة، وستكون لها حقوقها كاملة، وحرياتها مصونة؛ ونحن سوف نلاحظ ذلك؛ والذي يتبين من',
    'story' => 'قصتنا',
    'story_text' => 'مرحبًا بك في مدونة Alansaricodez - مصدرك المفضل لكل ما يتعلق بالبرمجة وتطوير الويب! سواء كنت مبرمجًا متمرسًا، أو مبتدئًا فضوليًا، أو في مكان ما بينهما، فقد تم تصميم مدونتنا لتكون بوصلتك في مشهد التكنولوجيا المتطور باستمرار.

    في مدونة Alansaricodez، نؤمن بأن البرمجة هي فن وعلم في نفس الوقت، ومنفذ إبداعي وأداة لحل المشكلات. إن شغفنا بعالم البرمجة هو ما يدفعنا إلى مشاركة أفكارنا وبرامجنا التعليمية وتحديثات الصناعة معك. مهمتنا هي تمكين الأفراد بالمعرفة والمهارات التي يحتاجونها للتفوق في المجال الديناميكي لتطوير الويب.
    
    من نحن؟ نحن مجموعة من المبرمجين المتحمسين ومطوري الويب وعشاق التكنولوجيا الذين اجتازوا المجال الرقمي لسنوات. تتراوح خبرتنا الجماعية من إنشاء مواقع ويب سريعة الاستجابة وجذابة إلى صياغة خوارزميات خلفية معقدة. مع كل سطر من التعليمات البرمجية التي نكتبها، يتم تذكيرنا بالإمكانيات اللامحدودة التي توفرها البرمجة.
    
    لماذا بدأنا هذه المدونة؟ في عالم يعتمد بشكل متزايد على التكنولوجيا، أصبح فهم تعقيدات البرمجة وتطوير الويب أكثر أهمية من أي وقت مضى. ومع ذلك، فإننا ندرك أن التنقل في هذا المجال المعقد قد يكون مرهقًا. ولدت هذه المدونة من الرغبة في تبسيط هذه المفاهيم، وكسر الحواجز، وتعزيز مجتمع تتدفق فيه المعرفة بحرية.
    
    ماذا يمكنك أن تتوقع من مدونتنا؟ الاستعداد للشروع في رحلة الاكتشاف. تغطي مقالاتنا مجموعة واسعة من المواضيع - بدءًا من أساسيات لغات البرمجة مثل Python وJavaScript وHTML/CSS، وحتى تقنيات وأطر تطوير الويب المتقدمة وأفضل الممارسات. سنرشدك من خلال البرامج التعليمية خطوة بخطوة، ونزيل الغموض عن المفاهيم المعقدة، ونبقيك على اطلاع بأحدث الاتجاهات والابتكارات في عالم التكنولوجيا.
    
    لكن هذه المدونة لا تتعلق فقط بمشاركة المعلومات معك - بل تتعلق ببناء مجتمع مزدهر. نحن نشجعك على طرح الأسئلة والمشاركة في المناقشات ومشاركة تجاربك. سواء كنت تبحث عن حلول لتحديات البرمجة أو تبحث عن الإلهام لمشروعك التالي، فإن مدونة Alansaricodez هنا لتقديم التوجيه والدعم الذي تحتاجه.
    
    شكرًا لانضمامك إلينا في هذه المغامرة المثيرة عبر العالم الرقمي. معًا، دعونا نكشف أسرار البرمجة وتطوير الويب ونمهد الطريق لمستقبل لا تعرف فيه التكنولوجيا حدودًا.',

    'create_blog' => 'انشئ مقالة',
    'create' => 'أنشئ',
    'title' => 'العنوان',
    'content' => 'المحتوى',
    'category' => 'التصنيف',
    'thumbnail' => 'الصورة',
    'search_result' => 'نتائج البحث',
    'discussion' => 'مناقشة',
    'be_the_first_to_comment' => 'كن أول من يعلق!',
    'by' => 'بواسطة',
    'manage_account' => 'ادارة الحساب',
    'browse_blogs' => 'تصفح جميع المدونات',
    'allblogs' => 'جميع المقالات',
    'submit' => 'أرسل',






];
